W5DMH/nanojs8/sdkconfig.defaults
# NanoJS8 — Default Kconfig overrides
#
# This file is read by the build system on every clean build. Once sdkconfig
# exists (after first `idf.py reconfigure`), this file is ignored unless
# explicitly re-applied. Treat it as the project's source-controlled config
# baseline; never edit sdkconfig directly.

# ----------------------------------------------------------------------------
# Target & toolchain
# ----------------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# C++ exceptions — REQUIRED for Phase 3a's VCP CP210x driver.
# espressif/usb_host_vcp and usb_host_cp210x_vcp use 'throw' for error
# propagation; building them with -fno-exceptions fails with
# "exception handling disabled" errors. Cost is ~30 KB binary size.
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y

# ----------------------------------------------------------------------------
# Partition table
# ----------------------------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ----------------------------------------------------------------------------
# Flash
# ----------------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ----------------------------------------------------------------------------
# CPU
# ----------------------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# ----------------------------------------------------------------------------
# Logging
# ----------------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_COLORS=y

# ----------------------------------------------------------------------------
# Console — Phase 3a: USB-C goes to USB-OTG host duty (DigiRig + radio),
# so the console moves to UART0 on GPIO 1 (TX) / GPIO 2 (RX) accessed via
# the Cardputer ADV's Grove port. Operators connect an external USB-UART
# cable to the Grove port to see logs and issue commands.
#
# Pin map (Grove on Cardputer ADV):
#   Pin 1 (Black/GND)  — GND
#   Pin 2 (Red/5V)     — leave unconnected (Cardputer self-powers)
#   Pin 3 (Yellow/G1)  — GPIO 1 — ESP TX → cable RX
#   Pin 4 (White/G2)   — GPIO 2 — ESP RX → cable TX
#
# Phase 0/1/2 used CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y. Phase 3a flips
# to UART0_CUSTOM. Flashing still happens via the USB-C port — the ROM
# bootloader's USB-CDC activates in DOWNLOAD mode regardless of the
# running firmware's console choice.
# ----------------------------------------------------------------------------
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_CUSTOM_NUM_0=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_TX_GPIO=1
CONFIG_ESP_CONSOLE_UART_RX_GPIO=2
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ----------------------------------------------------------------------------
# USB OTG host stack — required by nanojs8_radio component.
# Balanced FIFO bias gives IN 408 / OUT 192 bytes, which comfortably fits
# DigiRig CM108's mono 16-bit 48 kHz audio (96 B/dir/ms) with margin for
# concurrent CDC traffic on the PTT port. See Phase 3a design notes.
#
# External hub support is required for the powered-hub test setup (Belkin
# F4U022 etc.). Without this the host stack sees a hub but refuses to
# enumerate it, so DigiRig (connected to a hub downstream port) is invisible.
# Multi-level support is irrelevant for our single-hub topology but is
# included for free since it's default-on once HUBS_SUPPORTED is enabled.
#
# (CONFIG_USB_OTG_SUPPORTED is a hidden auto-symbol on ESP32-S3; the
# host stack components below pull it in transitively. We don't need
# to assert it here.)
# ----------------------------------------------------------------------------
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y
CONFIG_USB_HOST_HUBS_SUPPORTED=y

# ----------------------------------------------------------------------------
# WiFi / BLE — disabled in v1.0 per spec.
# Leaving the radio stack out saves ~120 KB flash and ~30 KB DRAM.
# Kconfig flag CONFIG_NANOJS8_ENABLE_BLE will toggle these on for variant builds.
# ----------------------------------------------------------------------------
# (Both are off by default in IDF starter; we just don't enable them.)

# ----------------------------------------------------------------------------
# Memory
# ----------------------------------------------------------------------------
# Allow heap allocations to walk into 8-bit-accessible IRAM if DRAM runs out.
# This is the same setting Mini-FT8 uses on Cardputer ADV.
CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y

# Panic behavior: AUTO-REBOOT rather than halt.
#
# Why: NanoJS8 is a field radio appliance and reliability is the top
# priority. ESP-IDF's experimental external-hub driver (ext_hub.c) can
# assert/panic on USB enumeration errors with composite devices that
# contain an internal hub (e.g. DigiRig) — an upstream bug we can't fix
# without vendoring the core usb component. Previously PANIC_PRINT_HALT
# left the device dead ("CPU halted") needing a manual power cycle. With
# auto-reboot, any such panic becomes a ~2 second self-recovery instead.
# The core dump is still written to flash first (see below), so we lose
# no post-mortem diagnostics. The (tr)uSDX path avoids the hub bug
# entirely, but this is defense-in-depth for every code path.
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_DEBUG_STUBS_ENABLE=y

# Stack size for the main task (where app_main runs). Default is 3584; we bump
# to 8192 for safety during init.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ----------------------------------------------------------------------------
# Core dump on panic — written to coredump partition for post-mortem.
# ----------------------------------------------------------------------------
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
